<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"db55fa66fe7406def42daaa9298aa8a517fa25347fa146b524dea6560dc665b4","plan_job_ref":"Job Pull Request Checks #4706 at https://github.com/GSA-TTS/FAC/actions/runs/14582526676","plan_out_hash":"9e4e0891b54b57b4309b4eca7e954687c0b4076c605d6de0fafdaeb1f41b5ace","plan_hash":"5f02e93afead1335075998b7329144de58ef8134df5110f422b0f071ba10779f","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 3 to add, 10 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.production.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
        id = "41e96938-1383-c2ce-3157-af85063feaa3"

-       policy {
-           destination_app = "608e1961-37b3-4401-ba35-c7d3be359232" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284"
        }

#        (2 unchanged blocks hidden)
    }

  # module.production.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
        id = "bffa4f44-73e2-295d-6c7e-2809a21406d6"

-       policy {
-           destination_app = "608e1961-37b3-4401-ba35-c7d3be359232" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99ba1218-5b6e-42fc-9484-00eebde48eda" -> null
        }
-       policy {
-           destination_app = "608e1961-37b3-4401-ba35-c7d3be359232" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "99ba1218-5b6e-42fc-9484-00eebde48eda"
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb"
        }
    }

  # module.production.cloudfoundry_network_policy.logshipper-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "logshipper-network-policy" {
        id = "63155665-aac2-9f9d-6c0f-c98cdcec4047"

-       policy {
-           destination_app = "608e1961-37b3-4401-ba35-c7d3be359232" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "85f6e332-8ef0-4fa1-bcc4-ba5803231358" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.production.cloudfoundry_network_policy.scanner-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "scanner-network-policy" {
        id = "65fbd285-0a4b-cfbe-3445-d40cc279c621"

-       policy {
-           destination_app = "608e1961-37b3-4401-ba35-c7d3be359232" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "c7d5a4a2-5eca-46e5-81f0-315381c5b873" -> null
        }
-       policy {
-           destination_app = "99ba1218-5b6e-42fc-9484-00eebde48eda" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "c7d5a4a2-5eca-46e5-81f0-315381c5b873" -> null
        }
+       policy {
+           destination_app = "99ba1218-5b6e-42fc-9484-00eebde48eda"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.production.module.cg-logshipper.cloudfoundry_app.logshipper_app will be updated in-place
!~  resource "cloudfoundry_app" "logshipper_app" {
!~      created_at                  = "2025-04-21T20:52:46Z" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "logshipper"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-production-logshipper.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "93ba903e051252644ff9eaa9ea0bfa3c9776bd91331dc49cf4907f6977eb831e" -> "e4e9e942a857c76a4792c6b18bcbee83cbcabc2c89084fc3a0a1cb94fb4d15e2"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-04-21T20:53:38Z" -> (known after apply)
#        (12 unchanged attributes hidden)
    }

  # module.production.module.cg-logshipper.cloudfoundry_route.logshipper_route will be updated in-place
!~  resource "cloudfoundry_route" "logshipper_route" {
!~      destinations = [
-           {
-               app_id           = "85f6e332-8ef0-4fa1-bcc4-ba5803231358" -> null
-               app_process_type = "web" -> null
-               id               = "92e80372-ae8a-4f64-86e4-11727a2d766d" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "bac6e24a-a79d-48d6-b96e-05fee20c0539"
!~      updated_at   = "2025-04-21T20:53:39Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.production.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-04-21T20:57:30Z" -> (known after apply)
        }
    }

  # module.production.module.fac-file-scanner.data.cloudfoundry_domain.internal will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "internal" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "apps.internal"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.production.module.fac-file-scanner.data.external.scannerzip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "scannerzip" {
+       id          = (known after apply)
+       program     = [
+           "/bin/sh",
+           "prepare-scanner.sh",
        ]
+       query       = {
+           "gitref" = "refs/heads/main"
        }
+       result      = (known after apply)
+       working_dir = "../shared/modules/scanner"
    }

  # module.production.module.fac-file-scanner.cloudfoundry_app.scanner_app will be updated in-place
!~  resource "cloudfoundry_app" "scanner_app" {
!~      created_at                  = "2025-04-21T20:53:41Z" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "fac-file-scanner"
!~      path                        = "../shared/modules/scanner/scanner.zip" -> (known after apply)
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-file-scanner-production.apps.internal" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "30fb22ce2ea853a4cf9e03d39e287ed94e041ba8f9ecc29faa0ee746e3188e32" -> (known after apply)
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-04-21T20:54:36Z" -> (known after apply)
#        (11 unchanged attributes hidden)
    }

  # module.production.module.fac-file-scanner.cloudfoundry_route.scanner_route must be replaced
-/+ resource "cloudfoundry_route" "scanner_route" {
!~      created_at   = "2025-04-21T20:54:36Z" -> (known after apply)
!~      destinations = [
-           {
-               app_id           = "c7d5a4a2-5eca-46e5-81f0-315381c5b873" -> null
-               app_process_type = "web" -> null
-               id               = "d4f5054e-f20d-46c5-9269-3037019bcce1" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
!~      domain       = "26df58ef-0c0d-4997-b68b-8defb7b3998b" -> (known after apply) # forces replacement
!~      id           = "************************************" -> (known after apply)
!~      protocol     = "http" -> (known after apply)
!~      updated_at   = "2025-04-21T20:54:36Z" -> (known after apply)
!~      url          = "fac-file-scanner-production.apps.internal" -> (known after apply)
#        (2 unchanged attributes hidden)
    }

  # module.production.module.https-proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2025-04-21T20:52:29Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "https-proxy"
!~      path                        = ".terraform/modules/production.https-proxy/egress_proxy/proxy.zip" -> "/tmp/terraform-data-dir/modules/production.https-proxy/egress_proxy/proxy.zip"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "gsa-tts-oros-fac-production-egress-https-proxy.apps.internal" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "f9d4ba14c759e11a7da240c63888eba36a4e58318999d11f604525c6b4be408a" -> "175a3a43404fb2a33deaf8fba9e461a196ec830fb1991f4dffac53a6504ffcc8"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-04-21T20:58:48Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.production.module.https-proxy.cloudfoundry_route.egress_route will be updated in-place
!~  resource "cloudfoundry_route" "egress_route" {
!~      destinations = [
-           {
-               app_id           = "608e1961-37b3-4401-ba35-c7d3be359232" -> null
-               app_process_type = "web" -> null
-               id               = "301409a5-a526-4295-a5bc-434d89b7b4c2" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "456570fe-c30a-4ed5-a2ef-ab3f768e617a"
!~      updated_at   = "2025-04-21T20:52:46Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.production.module.fac-file-scanner.module.quarantine.data.cloudfoundry_service_plans.s3 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_service_plans" "s3" {
+       name                  = "basic"
+       service_offering_name = "s3"
+       service_plans         = (known after apply)
    }

  # module.production.module.fac-file-scanner.module.quarantine.cloudfoundry_service_instance.bucket will be updated in-place
!~  resource "cloudfoundry_service_instance" "bucket" {
+       dashboard_url     = (known after apply)
        id                = "ca564d14-b89a-4944-a43f-033dca62ab30"
!~      last_operation    = {
!~          created_at  = "2025-03-14T15:36:40Z" -> (known after apply)
+           description = (known after apply)
!~          state       = "succeeded" -> (known after apply)
!~          type        = "update" -> (known after apply)
!~          updated_at  = "2025-03-14T15:36:40Z" -> (known after apply)
        } -> (known after apply)
!~      maintenance_info  = {
+           description = (known after apply)
+           version     = (known after apply)
        } -> (known after apply)
        name              = "fac-file-scanner-quarantine"
!~      service_plan      = "021bb2a3-7e11-4fc2-b06b-d9f5938cd806" -> (known after apply)
        tags              = [
            "s3",
            "terraform-cloudgov-managed",
        ]
!~      updated_at        = "2025-03-14T15:36:40Z" -> (known after apply)
!~      upgrade_available = false -> (known after apply)
#        (3 unchanged attributes hidden)
    }

  # module.production.module.file_scanner_clamav.module.route.data.cloudfoundry_domain.domain will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "domain" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "apps.internal"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.production.module.file_scanner_clamav.module.route.data.cloudfoundry_org.org will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_org" "org" {
+       annotations = (known after apply)
+       created_at  = (known after apply)
+       id          = (known after apply)
+       labels      = (known after apply)
+       name        = "gsa-tts-oros-fac"
+       quota       = (known after apply)
+       suspended   = (known after apply)
+       updated_at  = (known after apply)
    }

  # module.production.module.file_scanner_clamav.module.route.data.cloudfoundry_space.space will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "space" {
+       allow_ssh         = (known after apply)
+       annotations       = (known after apply)
+       created_at        = (known after apply)
+       id                = (known after apply)
+       isolation_segment = (known after apply)
+       labels            = (known after apply)
+       name              = "production"
+       org               = (known after apply)
+       quota             = (known after apply)
+       updated_at        = (known after apply)
    }

  # module.production.module.file_scanner_clamav.module.route.cloudfoundry_route.app_route must be replaced
-/+ resource "cloudfoundry_route" "app_route" {
!~      created_at   = "2025-04-21T20:55:12Z" -> (known after apply)
!~      destinations = [
-           {
-               app_id           = "99ba1218-5b6e-42fc-9484-00eebde48eda" -> null
-               app_process_type = "web" -> null
-               id               = "c11a74f0-2c55-49de-a77c-6f612ec50565" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = "************************************"
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
!~      domain       = "26df58ef-0c0d-4997-b68b-8defb7b3998b" -> (known after apply) # forces replacement
!~      id           = "************************************" -> (known after apply)
!~      protocol     = "http" -> (known after apply)
!~      space        = "5593dba8-7023-49a5-bdbe-e809fe23edf9" -> (known after apply) # forces replacement
!~      updated_at   = "2025-04-21T20:55:12Z" -> (known after apply)
!~      url          = "fac-av-production-fs.apps.internal" -> (known after apply)
#        (1 unchanged attribute hidden)
    }

Plan: 3 to add, 10 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4706](https://github.com/GSA-TTS/FAC/actions/runs/14582526676)